src/DataProcessors/ВыгрузкаБЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаБЛ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекДок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛистуПоДоговорамПодряда</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонОтв</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флажок1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флажок2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флажок3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SurName</Name>
					<Comment>//+ СВЭЙ КДЯ СВФР-004525  15.07.19</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GivenNames</Name>
					<Comment>//+ СВЭЙ КДЯ СВФР-004525  15.07.19</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ПричиныНетрудоспособности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныНетрудоспособности</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщееЗаболевание</Name>
					<Comment>Включая травмы по дороге на работу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТравмаНаПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛиквидаторамЧАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольничныйЛистАлкоголь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеБезЗаболевания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуДо7миЛетДляСостоящихВБраке</Name>
					<Comment>Оплачивается весь б/л, но через неделю - 50%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуДо7миЛетДляНеСостоящихВБраке</Name>
					<Comment>Оплачивается весь б/л, но через 10 дней - 50%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуДо15тиЛетДляСостоящихВБраке</Name>
					<Comment>Оплачивается две недели, вторая - 50%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуДо15тиЛетДляНеСостоящихВБраке</Name>
					<Comment>Оплачивается две недели, с 11-го дня - 50%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карантин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаВзрослым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Протезирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриДолечивании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТравмаВБыту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ВыгрузкаБЛ/Ext/ObjectModule.bsl
Процедура ВыгрузитьДанные() Экспорт
	
	Если Флажок2 И Не ЗначениеЗаполнено(ТекДок) Тогда
		Предупреждение("Для отменяющей формы должен быть выбран конкретный документ!");
	Иначе
		
		З = Новый Запрос;
		З.Текст = "ВЫБРАТЬ 
		|Док.Ссылка КАК Док,    
		|Док.СерияВходящегоДокумента КАК Серия,
		|Док.НомерВходящегоДокумента КАК Номер,
		|Док.ПервичныйБольничныйЛист КАК ПервичныйБЛ,
		|Док.ДатаНачала КАК НачалоБЛ,
		|Док.ДатаОкончания КАК ОкончаниеБЛ, 
		|Док.ПричинаНетрудоспособности КАК Причина,
		|Ложь КАК ПризнакДогПодряда,
		|Док.Сотрудник КАК Сотрудник,
		|Док.Сотрудник.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
		|ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
		|ФИОФизЛицСрезПоследних.Имя КАК Имя,
		|ФИОФизЛицСрезПоследних.Отчество КАК Отчество
		|
		|ИЗ Документ.НачислениеПоБольничномуЛисту КАК Док   
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаПо, ) КАК ФИОФизЛицСрезПоследних
		|ПО Док.Сотрудник.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|
		|ГДЕ Док.ПометкаУдаления = ЛОЖЬ
		|И Док.Дата МЕЖДУ &ДатаС и &ДатаПо";
		
		Если Флажок1 И НЕ Флажок2 Тогда
			З.Текст = З.Текст + "
			|И Док.Проведен = ИСТИНА";
		КонецЕсли; 
		
		//КВВ СВФР-012942 (
		Если Флажок3 Тогда
			З.Текст = З.Текст + "
			|И Док.ДокВыгруженНаПортал = ЛОЖЬ";
		КонецЕсли;
		//КВВ СВФР-012942 )
		
		Если ЗначениеЗаполнено(ТекДок) Тогда
			З.Текст = З.Текст + "
			|И Док.Ссылка = &ТекДок";  
		КонецЕсли;
		
		З.Текст = З.Текст + "
		|
		|ОБЪЕДИНИТЬ 
		|
		|ВЫБРАТЬ 
		|Док2.Ссылка, 
		|Док2.СерияВходящегоДокумента,
		|Док2.НомерВходящегоДокумента,
		|Док2.ПервичныйБольничныйЛист,
		|Док2.ДатаНачала,
		|Док2.ДатаОкончания, 
		|Док2.ПричинаНетрудоспособности,
		|Истина,// КАК ПризнакДогПодряда,
		|Док2.Сотрудник,
		|Док2.Сотрудник.ФизЛицо.СтраховойНомерПФР,
		|ФИОФизЛицСрезПоследних2.Фамилия,
		|ФИОФизЛицСрезПоследних2.Имя,
		|ФИОФизЛицСрезПоследних2.Отчество
		|
		|ИЗ Документ.НачислениеПоБольничномуЛистуПоДоговорамПодряда КАК Док2  
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаПо, ) КАК ФИОФизЛицСрезПоследних2
		|ПО Док2.Сотрудник.ФизЛицо = ФИОФизЛицСрезПоследних2.ФизЛицо
		|         
		|ГДЕ Док2.ПометкаУдаления = ЛОЖЬ
		|И Док2.Дата МЕЖДУ &ДатаС и &ДатаПо";
		
		Если Флажок1 И НЕ Флажок2 Тогда
			З.Текст = З.Текст + "
			|И Док2.Проведен = ИСТИНА";
		КонецЕсли;
		
		//КВВ СВФР-012942 (
		Если Флажок3 Тогда
			З.Текст = З.Текст + "
			|И Док2.ДокВыгруженНаПортал = ЛОЖЬ";
		КонецЕсли;
		//КВВ СВФР-012942 )
		
		Если ЗначениеЗаполнено(ТекДок) Тогда
			З.Текст = З.Текст + "
			|И Док2.Ссылка = &ТекДок";
		КонецЕсли;  
		З.УстановитьПараметр("ТекДок",ТекДок);
		З.УстановитьПараметр("ДатаС",ДатаС);
		З.УстановитьПараметр("ДатаПо",КонецДня(ДатаПо));
		РезЗ = З.Выполнить().Выгрузить();
		Если РезЗ.Количество() >0 Тогда
			ОргУНП = СокрЛП(Организация.ИНН);
			ОргУНПФСЗН = СокрЛП(Организация.РегистрационныйНомерПФР);
			
			ТекДата = НачалоМинуты(ТекущаяДата());
			//ТекДата = ТекущаяДатаСеанса();		
			
			СчДок = 0;
			Для Каждого Докк ИЗ РезЗ Цикл   
				Если НЕ ЗначениеЗаполнено(СокрЛП(Докк.Серия)) ИЛИ НЕ ЗначениеЗаполнено(СокРЛП(Докк.Номер)) Тогда
					Сообщить("Документ " + СокрЛП(Докк.Док) + " выгружен не будет, т.к. не внесены серия и номер!");
					Продолжить;
				КонецЕсли;
				
				//КВВ СВФР-012942 (
				//Если ТипЗнч(Докк.Док) = Тип("ДокументСсылка.НачислениеПоБольничномуЛисту") Тогда					
					ДокументОбъект = Докк.Док.ПолучитьОбъект();   
					ДокументОбъект.ДокВыгруженНаПортал = Истина;
					ДокументОбъект.Записать();
				//КонецЕсли;
				//КВВ СВФР-012942 )
					
					
				СчДок = СчДок + 1; 
				ТекДата = ТекДата + 1;
				
				//Сообщить(ТекДата);
				ТекГод = Формат(ТекДата, "ДФ=гггг"); 
				ТекМес = Формат(ТекДата, "ДФ=ММ"); 
				ТекДень = Формат(ТекДата, "ДФ=дд"); 
				ТекЧас = Формат(ТекДата, "ДФ=чч"); 
				ТекМин = Формат(ТекДата, "ДФ=мм"); 
				ТекСек = Формат(ТекДата, "ДФ=сс");
				
				ИмяФайлаПачки = "ZU1_" + ОргУНПФСЗН + "_" + ОргУНП + "_" + ?(Флажок2,"2","1") + "_000000_" + ТекГод + ТекМес + ТекДень + ТекЧас + ТекМин + ТекСек;
				
				//	ТекстФайла = "";
				//	ТекстФайла = Новый ТекстовыйДокумент;
				
				
				Данные = Новый Структура;
				Данные.Вставить("ver", "1.0");
				Данные.Вставить("forma", "ZU1");
				Данные.Вставить("unpf", Число(ВставитьВФайл(ОргУНПФСЗН)));
				Данные.Вставить("unp", ВставитьВФайл(ОргУНП));
				Данные.Вставить("plat", ВставитьВФайл(Организация.Наименование));
				Данные.Вставить("type", ?(Флажок2,2,1)); 
				Данные.Вставить("pck", ИмяФайлаПачки);
				Данные.Вставить("tel", СокрЛП(ТелефонОтв));
				Данные.Вставить("ddoc", Формат(ТекДата,"ДФ=dd/MM/yyyy"));
				Данные.Вставить("ndoc", 1);
				
				МассивДанных = Новый Массив;     
				
				ДанныеДок = Новый Структура;
				ДанныеДок.Вставить("num", 1);//СчДок);   
				ДанныеДок.Вставить("ils", ВставитьВФайл(СокрЛП(Докк.ЛичныйНомер)));
				ДанныеДок.Вставить("fzl", ВставитьВФайл(ВРЕГ(СокрЛП(Докк.Фамилия))));
				ДанныеДок.Вставить("izl", ВставитьВФайл(ВРЕГ(СокрЛП(Докк.Имя))));
				ДанныеДок.Вставить("ozl", ВставитьВФайл(ВРЕГ(СокрЛП(Докк.Отчество))));
				ДанныеДок.Вставить("numMed", ВставитьВФайл(СокрЛП(Докк.Серия)+СокРЛП(Докк.Номер)));
				
				Если ЗначениеЗаполнено(Докк.ПервичныйБЛ) 
					И ТипЗнч(Докк.ПервичныйБЛ) <> Тип("ДокументСсылка.ОтсутствиеНаРаботеОрганизаций") Тогда  //КВВ СВФР-012942
					ДанныеДок.Вставить("dfromIns", ?(Флажок2,"",Формат(Докк.ПервичныйБЛ.ДатаНачала,"ДФ=dd/MM/yyyy")));
					ДанныеДок.Вставить("dfromMed", ?(Флажок2,"",Формат(Докк.ПервичныйБЛ.ДатаНачала,"ДФ=dd/MM/yyyy")));
				Иначе
					ДанныеДок.Вставить("dfromIns", ?(Флажок2,"",Формат(Докк.НачалоБЛ,"ДФ=dd/MM/yyyy")));
					ДанныеДок.Вставить("dfromMed", ?(Флажок2,"",Формат(Докк.НачалоБЛ,"ДФ=dd/MM/yyyy")));
				КонецЕсли;
				ДанныеДок.Вставить("dtoMed", ?(Флажок2,"",Формат(Докк.ОкончаниеБЛ,"ДФ=dd/MM/yyyy")));
				
				//Если Флажок2 Тогда  всегда выгружаем prMed   не по постановлению, но портал принимает
				//	ДанныеДок.Вставить("prMed", "");
				//Иначе
					Если Докк.Причина = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
						ДанныеДок.Вставить("prMed", 2);
					Иначе
						ДанныеДок.Вставить("prMed", 1);
					КонецЕсли;
				//КонецЕсли;
				ДанныеДок.Вставить("prRel", ?(Докк.ПризнакДогПодряда,3,1));   
				
				//Если Флажок2 Тогда   всегда выгружаем prJoin не по постановлению, но портал принимает
				//	ДанныеДок.Вставить("prJoin", "");
				//Иначе
					
					Если Докк.Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство 
						И НЕ (Докк.ПризнакДогПодряда) 
						И Докк.Причина <> Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда   
						ДанныеДок.Вставить("prJoin", 1);
					Иначе
						ДанныеДок.Вставить("prJoin", 0);
					КонецЕсли;
				//КонецЕсли;
				
				Если Докк.ПризнакДогПодряда И ЗначениеЗаполнено(Докк.Док.ДоговорПодряда) Тогда     //КВВ СВФР-012942 (Ссылка на Док)
					ДанныеДок.Вставить("ddog", Формат(Докк.Док.ДоговорПодряда.ДатаПУ,"ДФ=dd/MM/yyyy"));  //КВВ СВФР-012942 (Ссылка на Док) 
					ДанныеДок.Вставить("ndog", СокрЛП(Докк.Док.ДоговорПодряда.НомерДляПу));        //КВВ СВФР-012942 (Ссылка на Док)
				Иначе
					ДанныеДок.Вставить("ddog", "");
					ДанныеДок.Вставить("ndog", "");
				КонецЕсли;
				
				МассивДанных.Добавить(ДанныеДок);
				
				Данные.Вставить("data", МассивДанных);
				
				
				ПутькФайлу = СокрЛП(КаталогВыгрузки); 
				ПутькФайлу = ПутькФайлу + ?(Прав(ПутькФайлу,1)="\","","\"); 
				
				ПутьКФайлуСИменем = ПутьКФайлу + ИмяФайлаПачки + ".txt";
				
				Запись = Новый ЗаписьJSON;
				ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ",Истина);
				Запись.ОткрытьФайл(ПутьКФайлуСИменем,КодировкаТекста.ANSI,, ПараметрыЗаписиJSON);
				
				ЗаписатьJSON(Запись, Данные);
				
				Запись.Закрыть();
				
				
				//	ТекстФайла.Записать( ПутьКФайлу + ИмяФайлаПачки + ".txt", КодировкаТекста.ANSI );
				Сообщить( "Файл сохранен: " + ПутьКФайлу + ИмяФайлаПачки ); 
				
			КонецЦикла;  
			Сообщить("Выгрузка данных завершена!");
		Иначе
			Сообщить("Не найдены документы по заданным условиям, ничего не выгружено.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры           

Функция ВставитьВФайл(Значение)
	Если Значение = Null Тогда
		Значение = "";
		Возврат Значение
	Иначе
		Возврат ?(СокрЛП(Значение) = ""," ",СокрЛП(Значение))
	КонецЕсли;
КонецФункции
